{
 "guidelines": {
  "1-1-1": {
   "id": "text-equiv-all",
   "title": "Non-text Content",
   "description": "All non-text content that is presented to the user has a text alternative that serves the equivalent purpose, except for the situations listed below.",
   "uri": "http://www.w3.org/TR/WCAG20/#text-equiv-all",
   "conformance_level": "A",
   "wuhcag_summary": "Provide text alternatives for non-text content",
   "wuhcag_detail": "<p><strong>Provide text alternatives for non-text content</strong></p>\n<p>Some users browse websites with images turned off (as do some users with slow internet connections). These must be true alternatives to the content: they must provide the same information.</p>\n<h2>What to do</h2>\n<ul>\n  <li>Add a text alternative to all of your images.</li>\n  <li>Add a text alternative to your audio and video (a succinct description of the topic).</li>\n  <li>Add a name to all of your controls (such as ‘Search’ or ‘Submit’).</li>\n</ul>\n",
   "wuhcag_tips": "<p>There are a few types of image that don’t need alt text: spacers, icons, purely decorative, tests and CAPTCHA images.</p>\n<p>Icons are usually used to complement text, rather than replace it, so there’s no need to duplicate your efforts here. Customers with screen readers would just hear the same thing twice anyway, which is the opposite of what we’re trying to do.</p>\n<p>Spacers are images used for padding, often for ease and not good coding. They are often used to preserve formatting and present no information, so they don’t need alt text.</p>\n<p>Tests and CAPTCHAs that would be undermined by text alternatives don’t need them. Although if you do use CAPTCHA, use one with an audio alternative or add your contact details somewhere close by to help your users if they get stuck.</p>\n<p>In all these cases, use ‘null’ alt text by simply leaving the alt text out, but do put the quotes in:</p>\n<pre class=\"brush: html; auto-links: false;\">&lt;img src=&quot;location-of-image.jpg&quot; alt=&quot;&quot; /&gt;</pre>\n<p>Screen readers will then skip the image rather than reading the filename or trying to substitute an alt text.</p>\n",
   "wuhcag_what_to_do": "",
   "wuhcag_exceptions": "",
   "wuhcag_related": [
    "1-4-5",
    "1-4-9"
   ]
  },
  "1-2-1": {
   "id": "media-equiv-av-only-alt",
   "title": "Audio-only and Video-only (Prerecorded)",
   "description": "For prerecorded audio-only and prerecorded video-only media, the following are true, except when the audio or video is a media alternative for text and is clearly labeled as such:",
   "uri": "http://www.w3.org/TR/WCAG20/#media-equiv-av-only-alt",
   "conformance_level": "A",
   "wuhcag_summary": "Provide an alternative to video-only and audio-only content",
   "wuhcag_detail": "<p><strong>Provide an alternative to video-only and audio-only content</strong></p>\n<p>Some users will find it difficult to use or understand things like podcasts and silent videos or animations.</p>\n<h2>What to do</h2>\n<ul>\n  <li>Write text transcripts for any audio-only media;</li>\n  <li>Write text transcripts for any video-only media; or</li>\n  <li>Record an audio-track for any video-only media;</li>\n  <li>Place the text transcript, or link to it, close to the media.</li>\n</ul>\n",
   "wuhcag_tips": "<p>Audio-only and video-only content needs to be supported by text transcripts that convey the same information as the media. Sometimes this is quite simple, other times you have to make a judgement call on what that really means. The best bet is, as always,to be honest with your customers: what does the media convey and does your transcript do the same? Could you swap one for the other?</p>\n<p>One of the most common uses for text transcripts is when a podcast is published online. Embedding a podcast in a page is a great way of sharing your content but no good for your customers with hearing impairments. A text transcript should contain everything mentioned in the recording.</p>\n<p>Less commonly, some videos do not have sound. Your customers with visual impairments need help with this kind of content. A text transcript for a video without sound should describe what is going on in the video as clearly as possible. Try to focus on\n  what the video is trying to say rather than getting bogged down with detail.</p>\n<div class='mailmunch-forms-in-post-middle' style='display: none !important;'></div>\n<p>As an alternative for video-only content, you could also choose to record an audio track that narrates the video.</p>\n<p>For both audio-only and video-only, create your text transcript and place it either directly beneath the content or insert a link next to the content.</p>\n",
   "wuhcag_what_to_do": "",
   "wuhcag_exceptions": "<p>If the content is itself an alternative (you don’t have to provide a transcript of the audio track you provided to explain the silent video you used).</p>\n",
   "wuhcag_related": [
    "1-2-2",
    "1-2-3",
    "1-2-5",
    "1-2-7",
    "1-2-8"
   ]
  },
  "1-2-2": {
   "id": "media-equiv-captions",
   "title": "Captions (Pre-recorded)",
   "description": "Captions are provided for all prerecorded audio content in synchronized media, except when the media is a media alternative for text and is clearly labeled as such.",
   "uri": "http://www.w3.org/TR/WCAG20/#media-equiv-captions",
   "conformance_level": "A",
   "wuhcag_summary": "Provide captions for videos with audio",
   "wuhcag_detail": "<p>Closed captioning is perhaps the most well known tool for people with disabilities. Often known as subtitles, or abbreviated as CC, closed captions have been around since the 1970s.</p>\n<p>Multimedia is becoming more and more popular as the average home gets faster and faster internet access. Videos are cropping up everywhere, from news websites to product pages. One of the most visited websites in the world, YouTube, is specifically for online videos. As website owners turn to video, you must think of how users process your multimedia content.</p>\n",
   "wuhcag_tips": "",
   "wuhcag_what_to_do": "<p>Adding captions to a video is a relatively hard task, compared to something like writing a text transcript or providing alternative text. Captions must be synchronised with the video to be useful, which means marking up the plain text with timestamps.</p>\n<p>There are plenty of paid services out there that will do your closed captioning for you, often at reasonable rates. There are also many free programs that will attempt to create your caption file for you, but none as good as human eyes and ears just yet. Like with many areas of web accessibility, your choice is between spending time (writing your own captions) or money (outsourcing).</p>\n<p>Google has written a very clear how-to guide on adding captions to YouTube videos, which I’m not going to try and better.</p>\n<p>Add captions to all videos with sound.</p>\n",
   "wuchcag_exceptions": "",
   "wuhcag_related": [
    "1-1-1",
    "1-2-1",
    "1-2-4"
   ]
  },
  "1-2-3": {
   "id": "media-equiv-audio-desc",
   "title": "Audio Description or Media Alternative (Prerecorded)",
   "description": "An alternative for time-based media or audio description of the prerecorded video content is provided for synchronized media, except when the media is a media alternative for text and is clearly labeled as such.",
   "uri": "http://www.w3.org/TR/WCAG20/#media-equiv-audio-desc",
   "conformance_level": "A",
   "wuhcag_summary": "Video with audio has a second alternative",
   "wuhcag_detail": "<p>An audio description is an edited version of a video’s soundtrack that adds more information than the regular soundtrack offers. This might mean narrating movements that are not audibly explained in the video, or adding context to visual information.</p>\n<p>The need for audio description isn’t always clear to website owners, yet it is among the most used accessibility feature in the real world. Many cinemas have audio described screenings, where film fans can use earphones that offer a different soundtrack to the regular feature. That soundtrack will be the regular one supplemented with extra information intended to help film lovers with visual impairments.</p>\n<p>To meet this guideline, it’s easier to provide users with a text transcript instead of audio description. However, the either/or option only covers Level A. To reach Level AA you would need to offer audio description. For Level AAA you need both audio description and text transcript.</p>\n",
   "wuhcag_tips": "<p>A full text transcript is a document that includes all information present in the audio or video source. This means including any visual cues (for example, ‘The fisherman holds up a large bass.’) as well as dialogue attribution and description.</p>\n<p>Providing audio description at this stage will fulfil Guideline 1.2.5 at Level AA but you will need both audio description and a transcript for Guideline 1.2.8 at Level AAA.</p>\n<p>If you’re going to the length of audio description for this guideline, you can also satisfy Guideline 1.2.5 and Guideline 1.2.7 by recording extended audio description tracks wherever necessary.</p>\n<p>Something like a straight face-to-face interview, or a speech-to-camera would probably not need audio description. If your video conveys all its information through sound, an audio description track is not needed. If you have this in your mind when you create videos, you can easily sidestep what could be a lengthy process.</p>\n<p>If you do need to add audio description, there are a number of options available to you. You can pay a firm to narrate an alternative soundtrack for you, or you can do it yourself. As usual, it’s a case of balancing your resources of time and money.</p>\n",
   "wuhcag_what_to_do": "<ul>\n\t<li>Provide a full text transcript of the video; or</li>\n\t<li>Provide a version of the video with audio description .</li>\n</ul>\n",
   "wuchcag_exceptions": "",
   "wuhcag_related": [
    "1-1-1",
    "1-2-1",
    "1-2-2",
    "1-2-5",
    "1-2-7",
    "1-2-8"
   ]
  },
  "1-2-4": {
   "id": "media-equiv-real-time-captions",
   "title": "Captions (Live)",
   "description": "Captions are provided for all live audio content in synchronized media.",
   "uri": "http://www.w3.org/TR/WCAG20/#media-equiv-real-time-captions",
   "conformance_level": "AA",
   "wuhcag_summary": "Video with audio has a second alternative",
   "wuhcag_detail": "<p>Your users sometimes rely on captions to enjoy your video content. Adding captions to live videos helps people use your website when you’re streaming live video.</p>\n",
   "wuhcag_tips": "<p>Live video is mainly used by large broadcasting companies, but you might want to provide a live stream of a seminar for people who can’t physically attend, or perhaps you’re working for a University and need to put graduation ceremonies online.</p>\n",
   "wuhcag_what_to_do": "<p>Use a content management system that allows captions to be added live and probably a professional subtitler to do it for you.</p>\n",
   "wuchcag_exceptions": "<p>If the video is an alternative for text.</p>\n",
   "wuhcag_related": [
    "1-2-2"
   ]
  },
  "1-2-5": {
   "id": "media-equiv-audio-desc-only",
   "title": "Audio Description (Prerecorded)",
   "description": "Audio description is provided for all prerecorded video content in synchronized media.",
   "uri": "http://www.w3.org/TR/WCAG20/#media-equiv-audio-desc-only",
   "conformance_level": "AA",
   "wuhcag_summary": "Users have access to audio description for video content",
   "wuhcag_detail": "<p>Some of your users will rely on audio description to help with videos. Adding audio description to your videos means these users have the same information as everyone else.</p>\n",
   "wuhcag_tips": "<p>If you have provided audio description for videos to meet Guideline 1.2.3, you have already fulfilled this guideline.</p>\n<p>Your audio description version must include everything that might be lost to a visually impaired user – things like:</p>\n<ul>\n <li>Relevant exposition (location, gestures, lighting, colours).</li>\n <li>Identifying new speakers.</li>\n <li>Marking the passing of time.</li>\n</ul>\n<p>This is by no means an exhaustive list. The key is to think about what information the video provides and ensure a user with a visual impairment gets the same information.</p>\n<p>Remember to use clear words, use the present tense and keep in sync with the video.</p>\n",
   "wuhcag_what_to_do": "<p>Make an alternative version of your video with an audio description soundtrack and link to it from near the original content.</p>\n",
   "wuchcag_exceptions": "<p>You don’t need an audio description if all of the information in the video is provided in the regular soundtrack. Something like a straight face-to-face interview, or a speech to-camera would probably not need audio description.</p>\n",
   "wuhcag_related": [
    "1-2-2",
    "1-2-3",
    "1-2-7",
    "1-2-8"
   ]
  },
  "1-2-6": {
   "id": "media-equiv-sign",
   "title": "Sign Language (Prerecorded)",
   "description": "Sign language interpretation is provided for all prerecorded audio content in synchronized media.",
   "uri": "http://www.w3.org/TR/WCAG20/#media-equiv-sign",
   "conformance_level": "AAA",
   "wuhcag_summary": "Provide sign language translations for videos",
   "wuhcag_detail": "<p>Some of your users will want to view sign language interpretations of your videos. Adding this feature offers those users the same information as others.</p>\n",
   "wuhcag_tips": "",
   "wuhcag_what_to_do": "<p>Make an alternative version of your video with a sign language interpreter embedded and link to it from near the original content.</p>\n",
   "wuchcag_exceptions": "",
   "wuhcag_related": [
    "1-1-1",
    "1-2-2",
    "1-2-3"
   ]
  },
  "1-2-7": {
   "id": "media-equiv-extended-ad",
   "title": "Extended Audio Description (Prerecorded)",
   "description": "Where pauses in foreground audio are insufficient to allow audio descriptions to convey the sense of the video, extended audio description is provided for all prerecorded video content in synchronized media.",
   "uri": "http://www.w3.org/TR/WCAG20/#media-equiv-extended-ad",
   "conformance_level": "AAA",
   "wuhcag_summary": "Provide extended audio description for videos",
   "wuhcag_detail": "<p>Your users who value audio description need to receive the same information that other users get from your video. Extended audio description can help where your video conveys large amounts of information without enough pauses in the regular soundtrack for audio description to work. Extended audio description is simply pausing the video to give a narrator enough time to convey the information in the video.</p>\n",
   "wuhcag_tips": "<ul>\n\t<li>Hire a video editor to get the timings right and synchronise the audio and video.</li>\n\t<li>If you chose to use audio description to fulfil Guideline 1.2.3, you may have already satisfied this guideline.</li>\n</ul>\n",
   "wuhcag_what_to_do": "<p>Make an alternative version of your video with an extended audio description soundtrack and link to it from near the original content.</p>\n",
   "wuchcag_exceptions": "<ul>\n <li>No audio description is needed if all of the information in the video is provided in the regular soundtrack. Something like a straight face-to-face interview, or a speech to-camera would probably not need audio description.</li>\n <li>You don’t need extended audio description if regular audio description can provide all of the information in the video.</li>\n</ul>\n",
   "wuhcag_related": [
    "1-2-3",
    "1-2-5",
    "1-2-8"
   ]
  },
  "1-2-8": {
   "id": "media-equiv-text-doc",
   "title": "Media Alternative (Prerecorded)",
   "description": "An alternative for time-based media is provided for all prerecorded synchronized media and for all prerecorded video-only media.",
   "uri": "http://www.w3.org/TR/WCAG20/#media-equiv-text-doc",
   "conformance_level": "AAA",
   "wuhcag_summary": "Provide a text alternative to your videos",
   "wuhcag_detail": "<p>While you may have produced captions or audio description to enhance your videos, some users will rely on a text alternative to get the information. Providing a full text transcript of a video, including links to any calls to action, can help make it more accessible.</p>\n",
   "wuhcag_tips": "<ul>\n <li>You may have fulfilled this Guideline if you chose to meet Guideline 1.2.3 with a text transcript and then fulfilled Guideline 1.2.5 with audio description.</li>\n <li>A good transcript contains all information in the video, such as visual cues, description and dialogue attribution.</li>\n</ul>\n",
   "wuhcag_what_to_do": "<ul>\n <li>Provide a full text transcript for your video and link to it from near the original content.</li>\n <li>If the video needs audio description, make sure that is also in place.</li>\n</ul>\n",
   "wuchcag_exceptions": "<p>If the video is itself an alternative, you don’t need to add a transcript.</p>\n",
   "wuhcag_related": [
    "1-2-3",
    "1-2-5",
    "1-2-7"
   ]
  },
  "1-2-9": {
   "id": "media-equiv-live-audio-only",
   "title": "Audio-only (Live)",
   "description": "An alternative for time-based media that presents equivalent information for live audio-only content is provided.",
   "uri": "http://www.w3.org/TR/WCAG20/#media-equiv-live-audio-only",
   "conformance_level": "AAA",
   "wuhcag_summary": "Provide alternatives for live audio",
   "wuhcag_detail": "<p>When broadcasting live audio-only content, such as a live podcast or radio stream, some users will rely on an alternative to the audio to understand your content.</p>\n",
   "wuhcag_tips": "<ul>\n  <li>To add live captions to an audio broadcast you will need professional software.</li>\n  <li>You may also want to hire a professional subtitler to get the best results.</li>\n</ul>\n",
   "wuhcag_what_to_do": "<ul>\n <li>Add closed captions to live audio; or</li>\n <li>If the live broadcast is from a prepared script, make the script text available from near the original content.</li>\n</ul>\n",
   "wuchcag_exceptions": "",
   "wuhcag_related": [
    "1-2-4"
   ]
  },
  "1-3-1": {
   "id": "content-structure-separation-programmatic",
   "title": "Info and Relationships",
   "description": "Information, structure,  and relationships conveyed through presentation can be programmatically determined or are available in text.",
   "uri": "http://www.w3.org/TR/WCAG20/#content-structure-separation-programmatic",
   "conformance_level": "A",
   "wuhcag_summary": "Structure your website logically",
   "wuhcag_detail": "<p>All users benefit when your web page structure is logical. Many of us take things like headings, bullet points, bolding and italics for granted. For your users with disabilities, those elements can make the difference between understanding a website and leaving it. Many forms of assistive technology rely on correct formatting to work correctly, meaning a heading can go a long way for your users.</p>\n<p>Because we use formatting elements so often, we can forget how to use them properly. Going back to basics is a great way to improve your content with relatively little effort.</p>\n",
   "wuhcag_tips": "<p>Ensuring that your web pages have an accessible structure is at once a simple and complex task. The level of difficulty depends on the complexity of your website; a page with several levels of headings will take more work than a single-topic blog post.</p>\n<p>An efficient way to check your markup is to use a HTML validator. This will tell you if the web page structure has any HTML errors – these errors won’t always equate to accessibility flaws but the cleaner your code the better. Errors like improperly closed paragraph tags are easily remedied.</p>\n<p>After using the validator, check pages manually for correctly nested headings and other more visible page elements. Manually check that any forms you use are labelled clearly too, simple things like required field asterisks that lack explanation can cause big problems.</p>\n",
   "wuhcag_what_to_do": "<p>Complying with the need for good web page structure and formatting is a wide-ranging target. Half-measures don't work, so you can’t use subheadings properly and then throw random bullet points all over the place.</p>\n<p>Amongst other things, you must:</p>\n<ul>\n <li>Break up content with subheadings for new sections. </li>\n <li>Mark those headings with HTML header tags. </li>\n <li>Use the correct HTML for all structural elements. </li>\n <li>Use valid HTML everywhere else. </li>\n <li>Use clear labels on forms.</li>\n</ul>\n",
   "wuchcag_exceptions": "",
   "wuhcag_related": [
    "1-3-2",
    "2-4-3",
    "2-4-6",
    "2-4-10",
    "4-1-1"
   ]
  },
  "1-3-2": {
   "id": "content-structure-separation-sequence",
   "title": "Meaningful Sequence",
   "description": "When the sequence in which content is presented affects its meaning, a correct reading sequence can be programmatically determined.",
   "uri": "http://www.w3.org/TR/WCAG20/#content-structure-separation-sequence",
   "conformance_level": "A",
   "wuhcag_summary": "Present your website content in a meaningful order",
   "wuhcag_detail": "<p>The meaning of content on your website relies on the order you present it. For example, in English we read from left to right and read a left-hand column before a right-hand column. Present the content on your website in an order that your users can understand.</p>\n<p>Some of your users rely on assistive technology (like a screen reader) to interpret content. By sequencing content correctly, you can make sure that your users with disabilities can understand your website and improve your overall web accessibility.</p>\n",
   "wuhcag_tips": "<p>Invest in some assistive technology and use it to browse your website. <a href=\"http://www.nvaccess.org/\">NVDA is a free screen reader</a> you can try to get started.</p>\n<p>Turn off the site’s Cascading Style Sheet (CSS) and check that your web page displays in the correct order. You can use an extension like <a href=\"http://www.chromeextensions.org/webmaster-seo/pendule/\">Pendule for Chrome</a> to easily toggle CSS on and off.</p>\n<p>Using headings to show importance isn’t always straightforward. Headings on a web page are a great way to break up content and show your users the relative importance of each section. Headings in HTML range from 1 (the most important) to 6 (the least important). It’s best to have just one Heading1 (H1) on a web page, to show the title of that page.</p>\n<p>However, headings don’t need to descend from 1 to 6 each time you use one. As well as headings that share levels, you can skip levels altogether if that fits your content.</p>\n",
   "wuhcag_what_to_do": "<p>Ensuring you present your content in a meaningful sequence is a wide-ranging part of web accessibility. It applies to all elements of all pages, so is as big or as small a task as your website.</p>\n<p>Make sure you:</p>\n<ul>\n <li>Present content in a meaningful order.</li>\n <li>Separate navigation menus from content.</li>\n</ul>\n<p>Always present your content so that it preserves your meaning. That way, it’s great for anyone reading it. The main things to look out for are:</p>\n<ul>\n <li>Use paragraphs in order.</li>\n <li>Use headings to show importance.</li>\n <li>Choose whether a list needs numbering or not.</li>\n <li>Use valid HTML and check it with the W3C’s markup validator.15</li>\n</ul>\n",
   "wuchcag_exceptions": "",
   "wuhcag_related": [
    "1-3-1",
    "2-4-2",
    "2-4-3",
    "2-4-6"
   ]
  },
  "1-3-3": {
   "id": "content-structure-separation-understanding",
   "title": "Sensory Characteristics",
   "description": "Instructions provided for understanding\nand operating content do not rely solely on sensory characteristics of components such as shape, size, visual location, orientation, or sound.",
   "uri": "http://www.w3.org/TR/WCAG20/#content-structure-separation-understanding",
   "conformance_level": "A",
   "wuhcag_summary": "Use more than one sense for instructions",
   "wuhcag_detail": "<p>Sensory characteristics is an important but ridiculous-sounding phrase in web accessibility. It’s actually far less complicated than it sounds. The sensory characteristics of your website are things like shape, sound, position and size.</p>\n<p>You'll often come across sensory characteristics in instructions to your users. Saying things like ‘Use the search bar on the right’ isn’t helpful to a user who doesn’t understand what right is. The main solution is to use more than one indicator for instructions.</p>\n",
   "wuhcag_tips": "<p>Creating accessible instructions is great for everyone. The clearer your instructions are, the more likely users will follow them – this is especially useful for things like buying instructions. Getting this guideline right might just make you more money or get you more users by reducing dropouts.</p>\n<p>A good instruction will use several sensory characteristics. Consider the accessibility of these four examples:</p>\n<ul>\n <li>‘Use the search box’</li>\n <li>‘Use the search box on the right’</li>\n <li>‘Search by using the green rectangle box labelled ‘Search’ on the right’</li>\n <li>‘Search by using the rectangle box at the very top right of this page’</li>\n</ul>\n<p>Web designers often have an aversion to adding words, feeling that it adds to confusion. In this case, the opposite can be true. Of course, ideally you want a website that feels instinctive with clear actions. When you need instructions, get them right.</p>\n<p>It’s best to avoid sound on a website, other than in media. No one likes unexpected sounds. It’s always hard to tell what the sound means and what you did do make it happen. A prime example is if you use sounds to alert users to errors on a form. The user can't tell exactly what made the error, they won't even be sure the sound indicated an error. Your users with hearing impairments have no chance.</p>\n<p>For forms, use a clear visual clue for errors and avoid sounds altogether.</p>\n<p>By making sure you don’t rely only on colour in your instructions, you can work towards Guideline 1.4.1.</p>\n",
   "wuhcag_what_to_do": "<p>Getting sensory characteristics right is mainly a case of using your common sense. There are no technical requirements, just good and sensible copy writing:</p>\n<ul>\n <li>Use more than one sense for instructions.</li>\n <li>Avoid instructions that rely on sound.</li>\n</ul>\n",
   "wuchcag_exceptions": "",
   "wuhcag_related": [
    "1-4-1"
   ]
  },
  "1-4-1": {
   "id": "visual-audio-contrast-without-color",
   "title": "Use of Color",
   "description": "Color is not used as the only visual means of conveying information, indicating an action, prompting a response, or distinguishing a visual element.",
   "uri": "http://www.w3.org/TR/WCAG20/#visual-audio-contrast-without-color",
   "conformance_level": "A",
   "wuhcag_summary": "Don’t use presentation that relies solely on colour",
   "wuhcag_detail": "<p>Your users with visual impairment need help when you use colour on your website. As many as <a href=\"http://www.colourblindawareness.org/colour-blindness\">1 in 12 men have some degree of colour blindness</a>. That means that somewhere around 8% of your male users will struggle with your website if you don’t use colour correctly.</p>\n",
   "wuhcag_tips": "<p>Check for colour issues by printing samples from your website in black and white. Are there any instructions you can’t follow or is there information you can’t understand?</p>\n<p>Making your website accessible to colour blind users is simple. The main area to focus on is giving instructions. Saying things like ‘Click the green button’ or ‘Required fields are red’ is useless to users who can’t see green or red. Back these kinds of instructions up with at least one more identifying remark.</p>\n<p>Another point is to make sure that important graphics are not dependent on colour alone. For example, your users might not understand a pie chart where only colour separates the segments. In this case, you should add clear labelling and patterns to the segments.</p>\n<p>There’s an overlap here with Guideline 1.3.3. Instructions should always be clear and give your customers the detail they need.</p>\n<p>This guideline is not about removing all traces of colour from your website, far from it. It just means that colour must not be the only way of conveying the information or instruction. A common misconception is that web accessibility means making your website black and white, and making it completely boring. Web accessibility is about improving websites, not taking away from them.</p>\n",
   "wuhcag_what_to_do": "<p>Using colour is mainly a case of using your common sense:</p>\n<ul>\n <li>Instructions must not rely on colour alone.</li>\n <li>Other information (like charts and graphs) must not rely on colour alone.</li>\n</ul>\n",
   "wuchcag_exceptions": "",
   "wuhcag_related": [
    "1-3-3"
   ]
  },
  "1-4-2": {
   "id": "visual-audio-contrast-dis-audio",
   "title": "Audio Control",
   "description": "If any audio on a Web page plays automatically for more than 3 seconds, either a mechanism is available to pause or stop the audio, or a mechanism is available to control audio volume independently from the overall system volume level.",
   "uri": "http://www.w3.org/TR/WCAG20/#visual-audio-contrast-dis-audio",
   "conformance_level": "A",
   "wuhcag_summary": "Don’t play audio automatically",
   "wuhcag_detail": "<p>Automatically playing sounds doesn't help your users. Your users don't need audio distractions when visiting your website. You have a hard enough time getting them to do what you want. Some of your users will have problems focusing and unexpected sounds can distract them further.</p>\n",
   "wuhcag_tips": "",
   "wuhcag_what_to_do": "<ul>\n  <li>Don’t have any audio that plays automatically.</li>\n  <li>Have all the audio you want, just let your users choose when they want to hear it.</li>\n</ul>\n",
   "wuchcag_exceptions": "<p>Although you can pass this guideline by adding a pause, mute or stop function to automatic audio, that’s a bad idea. You don't want your users frantically searching around your website for the audio control.</p>\n<p>Users shouldn't have to take action for a better experience, you need to provide it to them by default.</p>\n<p>There’s a further exception on audio that plays for less than three seconds. Ignore this too. Three seconds of audio can still distract users, especially those who have problems maintaining focus.</p>\n",
   "wuhcag_related": null
  },
  "1-4-3": {
   "id": "visual-audio-contrast-contrast",
   "title": "Contrast (Minimum)",
   "description": "The visual presentation of text and images of text has a contrast ratio of at least 4.5:1, except for the following:",
   "uri": "http://www.w3.org/TR/WCAG20/#visual-audio-contrast-contrast",
   "conformance_level": "AA",
   "wuhcag_summary": "Contrast ratio between your text and background is at least 4.5:1",
   "wuhcag_detail": "<p>All of your users will benefit from a good contrast between the text on your website and the background colour. Some of your users with visual impairments need a stronger contrast than others, so getting your colours right is essential.</p>\n",
   "wuhcag_tips": "<ul>\n  <li>Picking a contrast of at least 7:1 will also fulfil Guideline 1.4.6.</li>\n  <li>Remember to ensure that all colours used conform. This includes links that change colour after being used once, and headings in menus and sidebars, as well as main content.</li>\n  <li>Make sure that any embedded charts or images of charts have the minimum contrast between elements (for example, bars, axes and labels).</li>\n  <li>This guideline also applies to images of text (but you shouldn’t be using images of text, see Guideline 1.4.5.</li>\n</ul>\n",
   "wuhcag_what_to_do": "<p>Make sure the contrast ratio between your text and background is at least 4.5:1.</p>\n<p>Do this by:</p>\n<ul>\n <li>Using a light background and dark text; or</li>\n <li>Using a dark background and light text; and</li>\n <li>Using <a href=\"http://webaim.org/resources/contrastchecker/\">WebAim’s colour contrast checker</a> to verify your choice.</li>\n</ul>\n",
   "wuchcag_exceptions": "<ul>\n  <li>Text that is 18 points or larger (or 14 points or larger, if bold) must have a contrast of at least 3:1.</li>\n  <li>If the text is purely decorative. </li>\n  <li>If the text is an incidental part of an image (for example, a man who is reading a newspaper or a landscape that happens to include a street sign).</li>\n  <li>Brand logos.</li>\n</ul>\n",
   "wuhcag_related": [
    "1-4-5",
    "1-4-6",
    "1-4-9"
   ]
  },
  "1-4-4": {
   "id": "visual-audio-contrast-scale",
   "title": "Resize text",
   "description": "Except for captions and images of text, text can be resized without assistive technology up to 200 percent without loss of content or functionality.",
   "uri": "http://www.w3.org/TR/WCAG20/#visual-audio-contrast-scale",
   "conformance_level": "AA",
   "wuhcag_summary": "Text can be resized to 200% without loss of content or function",
   "wuhcag_detail": "<p>Some of your users with visual impairments will need to resize text in order to understand it fully. You should allow for up to a 200% resize of text without dropping any content or functions.</p>\n",
   "wuhcag_tips": "<ul>\n <li>Resizing text is different to zooming (which enlarges text, images and layout without preserving formatting).</li>\n <li>Check your website by resizing to 200% in a variety of browsers.</li>\n <li>Make sure your resized text doesn’t require the user to scroll horizontally and you fulfil part of Guideline 1.4.8.</li>\n</ul>\n",
   "wuhcag_what_to_do": "",
   "wuchcag_exceptions": "<ul>\n <li>Images of text (but don’t use images of text, because they don’t resize well).</li>\n <li>Captions.</li>\n</ul>\n",
   "wuhcag_related": [
    "1-4-5",
    "1-4-8",
    "1-4-9"
   ]
  },
  "1-4-5": {
   "id": "visual-audio-contrast-text-presentation",
   "title": "Images of Text",
   "description": "If the technologies being used can achieve the visual presentation, text is used to convey information rather than images of text except.",
   "uri": "http://www.w3.org/TR/WCAG20/#visual-audio-contrast-text-presentation",
   "conformance_level": "AA",
   "wuhcag_summary": "Don't use images of text",
   "wuhcag_detail": "<p>Some of your users will visit your website using a text-only browser, or might have images turned off in a regular browser. Images of text cause problems, as they are harder for those users to understand.</p>\n<p>Images of text also cause problems for your users if they like to resize websites to read them more clearly because images do not work well this way. They also add to the time it takes your website to load, another key reason users will leave your website.</p>\n",
   "wuhcag_tips": "<p>Images of text are subject to guidelines on colour contrast. See Guideline 1.4.3 and Guideline 1.4.6.</p>\n",
   "wuhcag_what_to_do": "<ul>\n <li>Do not use an image of text when you can use plain text.</li>\n <li>Display quotes as text rather than images.</li>\n <li>Use CSS to style headings.</li>\n <li>Use CSS to style navigation menus as text.</li>\n</ul>\n",
   "wuchcag_exceptions": "<ul>\n <li>Brand logos.</li>\n <li>If using an image of text is essential because you can't achieve the effect with text (for example, presenting a particular example of typography).</li>\n <li>If the presentation can’t be achieved with the technology used to design the website. However, this exception is removed in Level AAA Guideline 1.4.9.</li>\n <li>Purely decorative text.</li>\n</ul>\n",
   "wuhcag_related": [
    "1-1-1",
    "1-4-3",
    "1-4-6",
    "1-4-9"
   ]
  },
  "1-4-6": {
   "id": "visual-audio-contrast7",
   "title": "Contrast (Enhanced)",
   "description": "The visual presentation of text and images of text has a contrast ratio of at least 7:1, except for the following:",
   "uri": "http://www.w3.org/TR/WCAG20/#visual-audio-contrast7",
   "conformance_level": "AAA",
   "wuhcag_summary": "Contrast ratio between your text and background is at least 7:1",
   "wuhcag_detail": "<p>All of your users will benefit from a good contrast between the text on your website and the background colour. Some of your users with visual impairments need a stronger contrast than others, so getting your colours right is essential.</p>\n<p>While the minimum contrast for Level AA was 4.5:1, for Level AAA it’s 7:1. This higher level of contrast makes it even easier for everyone to read your content.</p>\n",
   "wuhcag_tips": "<ul>\n <li>You may have fulfilled this guideline when you complied with Guideline 1.4.3.</li>\n <li>Remember to ensure that all colours used conform. This includes links that change colour after being used once, and headings in menus and sidebars, as well as main content.</li>\n <li>Make sure that any embedded charts or images of charts have the minimum contrast between elements (for example, bars, axes and labels).</li>\n <li>This guideline also applies to images of text (but you shouldn't be using images of text – see Guideline 1.4.5).</li>\n</ul>\n",
   "wuhcag_what_to_do": "<p>Make sure the contrast ratio between your text and background is at least 7:1.</p>\n<p>Do this by:</p>\n<ul>\n <li>Using a light background and dark text; or</li>\n <li>Using a dark background and light text; and</li>\n <li>Using a colour contrast checker to verify your choice.</li>\n</ul>\n",
   "wuchcag_exceptions": "<ul>\n <li>Text that is 18 points or larger (or 14 points or larger, if bold) must have a contrast of at least 4.5:1.</li>\n <li>Where text is purely decorative – so you could have a block of different coloured words on a blue background if it didn't mean anything to your users and their order was random.</li>\n <li>Where the text is an incidental part of an image (for example, a man who is reading a newspaper or a landscape that happens to include a street sign).</li>\n <li>Brand logos.</li>\n</ul>\n",
   "wuhcag_related": [
    "1-4-3"
   ]
  },
  "1-4-7": {
   "id": "visual-audio-contrast-noaudio",
   "title": "Low or No Background Audio",
   "description": "For prerecorded audio-only content that (1) contains primarily speech in the foreground, (2) is not an audio CAPTCHA or audio logo, and (3) is not vocalization intended to be primarily musical expression such as singing or rapping, at least one of the following is true:",
   "uri": "http://www.w3.org/TR/WCAG20/#visual-audio-contrast-noaudio",
   "conformance_level": "AAA",
   "wuhcag_summary": "Your audio is clear for listeners to hear",
   "wuhcag_detail": "<p>Some of your users will have difficulties with their hearing. They will not be able to hear your audio content as clearly as other users. You can help by ensuring that all of your audio is clear.</p>\n<p>If you have pre-recorded audio-only content, keep background noise to a minimum so that the speaking voices can be heard.</p>\n",
   "wuhcag_tips": "<ul>\n <li>Record your audio in a place you know will be quiet (a room with lots of soft furnishings is best if you haven’t got a studio).</li>\n <li>Embed good quality audio (you should be doing this anyway if you care about your website).</li>\n</ul>\n",
   "wuhcag_what_to_do": "<ul>\n <li>Make sure your pre-recorded audio does not contain any background noise; or</li>\n <li>If there has to be some background noise, it is generally 20 decibels lower than the foreground noise. That’s about four times quieter.</li>\n</ul>\n",
   "wuchcag_exceptions": "<p>Background noise is acceptable if:</p>\n<ul>\n <li>The audio isn't mainly speech (for example, in an audio play, an action scene might have a helicopter blown up by a car).</li>\n <li>The audio is part of a CAPTCHA element (CAPTCHA is a test that separates humans from spam bots and is often used in forms).</li>\n <li>The audio is you <q><a href=\"http://www.w3.org/TR/UNDERSTANDING-WCAG20/visual-audio-contrast-noaudio.html\">singing or rapping</a>.</q></li>\n</ul>\n",
   "wuhcag_related": null
  },
  "1-4-8": {
   "id": "visual-audio-contrast-visual-presentation",
   "title": "Visual Presentation",
   "description": "For the visual presentation of blocks of text, a mechanism is available to achieve the following:",
   "uri": "http://www.w3.org/TR/WCAG20/#visual-audio-contrast-visual-presentation",
   "conformance_level": "AAA",
   "wuhcag_summary": "Offer users a range of presentation options",
   "wuhcag_detail": "<p>Some of your users will have difficulty viewing your website with the same clarity as others. There's no way you can guess every combination of colours and sizes your users prefer, but you can offer ways for them to customise their view.</p>\n<p>Allowing your users to select from a range of visual presentation options will help them to get the best from your website.</p>\n",
   "wuhcag_tips": "<ul>\n <li>The <a href=\"http://www.w3.org/TR/2010/NOTE-WCAG20-TECHS-20101014/working-examples/G175/index.php\">W3C’s in-depth colour picker</a> will cover feature number 1 noted prior.</li>\n <li>The <a href=\"http://www.bbc.co.uk/accessibility\">BBC’s accessibility page</a> has a good range of colour and spacing options.</li>\n <li>Add all visual presentation options to the header of your website, so they are some of the first things that your users see.</li>\n</ul>\n",
   "wuhcag_what_to_do": "<p>The following five features are cumulative, as all must be in place to pass Guideline 1.4.8:</p>\n<ol>\n <li>Provide a tool that enables your customers to select from a number of background and foreground colours; and</li>\n <li>Text blocks must be no wider than 80 characters (make sure resized browser windows do not need horizontal scrolling); and</li>\n <li>Text is not justified to both sides of the webpage; and</li>\n <li>Provide a tool that enables your users to select from a number of line and paragraph spacing options – one of the options must give line spacing that is at least 1.5 in text blocks and spaces between paragraphs are at least 1.5x line spacing; and</li>\n <li>Text can be resized in a browser up to 200% without requiring the user to scroll horizontally (you may have fulfilled this when you complied with Guideline 1.4.4).</li>\n</ol>\n",
   "wuchcag_exceptions": "",
   "wuhcag_related": [
    "1-4-4"
   ]
  },
  "1-4-9": {
   "id": "visual-audio-contrast-text-images",
   "title": "Images of Text (No Exception)",
   "description": "Images of text are only used for pure decoration or where a particular presentation of text is essential to the information being conveyed.",
   "uri": "http://www.w3.org/TR/WCAG20/#visual-audio-contrast-text-images",
   "conformance_level": "AAA",
   "wuhcag_summary": "Don't use images of text",
   "wuhcag_detail": "<p>Some of your users will visit your website using a text-only browser, or might have images turned off in a regular browser. Images of text cause problems, as they are harder for those users to understand.</p>\n<p>Images of text also cause problems for your users if they like to resize websites to read them more clearly, because images do not work well this way. They also add to the time it takes your website to load, another key reason users will leave your website.</p>\n",
   "wuhcag_tips": "<ul>\n <li>You may already comply with this guideline, depending on how you addressed Guideline 1.4.5.</li>\n <li>Images of text are subject to guidelines on colour contrast. See Guideline 1.4.3 and Guideline 1.4.6.</li>\n</ul>\n",
   "wuhcag_what_to_do": "<ul>\n <li>Don't use an image of text when you can use plain text.</li>\n <li>Display quotes as text rather than images.</li>\n <li>Use <abbr title=\"Cascading Style Sheets\">CSS</abbr> to style headings.</li>\n <li>Use CSS to style navigation menus as text.</li>\n</ul>\n",
   "wuchcag_exceptions": "<p>Despite the title of Guideline 1.4.9, some exceptions allow you to use images of text on your website:</p>\n<ul>\n <li>Brand logos.</li>\n <li>If using an image of text is essential because you can't achieve the effect with text (for example, presenting a particular example of typography).</li>\n <li>If the text is purely decorative.</li>\n</ul>\n",
   "wuhcag_related": [
    "1-1-1",
    "1-4-3",
    "1-4-5",
    "1-4-6"
   ]
  },
  "2-1-1": {
   "id": "keyboard-operation-keyboard-operable",
   "title": "Keyboard",
   "description": "All functionality of the content is operable through a keyboard interface without requiring specific timings for individual keystrokes, except where the underlying function requires input that depends on the path of the user's movement and not just the endpoints.",
   "uri": "http://www.w3.org/TR/WCAG20/#keyboard-operation-keyboard-operable",
   "conformance_level": "A",
   "wuhcag_summary": "Accessible by keyboard only",
   "wuhcag_detail": "<p>Your customers will have varying degrees of motor skills and will benefit from keyboard accessibility. Customers with motor impairment, including many elderly customers, need your help to navigate your website. Many of these customers will use their keyboard to move around your website.</p>\n<p>This article explains what you need to do to meet <strong>Guideline 2.1.1 – Keyboard</strong> from the <a href=\"http://www.wuhcag.com/web-content-accessibility-guidelines/\">Web Content Accessibility Guidelines 2.0</a>.</p>\n<p>All parts of your website must pass keyboard accessibility. That means your forms, menus, shopping cart and everything between. On top of that, you cannot require specific timings for keystrokes to access any feature on your website.</p>\n",
   "wuhcag_tips": "",
   "wuhcag_what_to_do": "<ul>\n\t<li>A clean <abbr title=\"HyperText Markup Language\">HTML</abbr> and <abbr title=\"Cascading Style Sheets\">CSS</abbr> website will often have keyboard accessibility without further work - a great example of why you need to invest in web design and development from the outset</li>\n</ul>\n<h2>Auditing keyboard accessibility</h2>\n<ul>\n\t<li>Unplug your mouse and make sure you can fully use your website with your keyboard</li>\n\t<li>Make sure no function on your website requires timed keystrokes - such as double tap enter/return within two seconds to submit</li>\n</ul>\n<h2>A few more things</h2>\n<p>At the lowest level of accessibility (which <strong>2.1.1 - Keyboard</strong> is), you can get away with functions that require a mouse pointer for input. These are things like free drawing tools and some types of game. Just think carefully about who you are excluding when you use these features.</p>\n<p>One thing that gets thrown out a lot by keyboard accessibility advocates is ‘Access keys’. You’re already familiar with access keys, which is why people are quick to accept them as useful. Access keys are keyboard shortcuts like ctrl +  p to print pr ctrl + s to save.</p>\n<p>Access keys work great in programs like Microsoft Word and Adobe Reader because they’re in a controlled environment. Out on the wild wild web, things aren’t so simple. Your customers access your website on a number of web browsers; some use Internet Explorer, some Firefox, some Google Chrome and so on... These web browsers have different levels of support for Access keys.</p>\n<p>Frustratingly, Access keys are a good idea for keyboard accessibility with bad implementation. If you’re a regular computer user, you probably use ctrl + p  much more often than selecting the menu with your mouse pointer. WebAIM has an <a href=\"http://webaim.org/techniques/keyboard/accesskey\">article about Access keys</a> if you want to know more. My advice: avoid them.</p>\n",
   "wuchcag_exceptions": "",
   "wuhcag_related": [
    "2-1-2",
    "2-4-3",
    "2-4-7"
   ]
  },
  "2-1-2": {
   "id": "keyboard-operation-trapping",
   "title": "No Keyboard Trap",
   "description": "If keyboard focus can be moved to a component of the page using a keyboard interface, then focus can be moved away from that component using only a keyboard interface, and, if it requires more than unmodified arrow or tab keys or other standard exit methods, the user is advised of the method for moving focus away.",
   "uri": "http://www.w3.org/TR/WCAG20/#keyboard-operation-trapping",
   "conformance_level": "A",
   "wuhcag_summary": "Your website must not trap keyboard users",
   "wuhcag_detail": "<p>Your users have varying degrees of motor skills and may use your website with only their keyboard.\nYou must make sure that keyboard-only users can’t get stuck anywhere on your site. All parts of your website should be reachable by keyboard alone (See Guideline 2.1.1). Your users must also be able to navigate away from all parts of your website. If your users can reach a feature (such as a subscribe form) by keyboard but can’t leave it by keyboard, they are keyboard trapped.</p>\n",
   "wuhcag_tips": "<ul>\n <li>Unplug your mouse and make sure you can fully use your website with your keyboard.</li>\n <li>It’s tempting to use non-standard navigation with a text explanation of what to do, but this isn't worth your time. Stick to the Tab and arrow keys and the majority of your customers will already know how to use your website.</li>\n <li>Be wary of third-party adverts and widgets, often these are not accessible.</li>\n</ul>\n",
   "wuhcag_what_to_do": "<ul>\n <li>Test your website to make sure you can navigate away from, as well as to, all parts of your website by keyboard only.</li>\n <li>Make sure all navigation is controllable by either the ‘Tab’ or arrow keys, which is a standard many people are familiar with.</li>\n</ul>\n",
   "wuchcag_exceptions": "",
   "wuhcag_related": [
    "2-1-1"
   ]
  },
  "2-1-3": {
   "id": "keyboard-operation-all-funcs",
   "title": "Keyboard (No Exception)",
   "description": "All functionality of the content is operable through a keyboard interface without requiring specific timings for individual keystrokes.",
   "uri": "http://www.w3.org/TR/WCAG20/#keyboard-operation-all-funcs",
   "conformance_level": "AAA",
   "wuhcag_summary": "Your website is accessible by keyboard only, without exception",
   "wuhcag_detail": "<p>Your users have varying degrees of motor skills and may use your website with only their keyboard. Users with motor impairment, including many elderly users, need help to navigate your website.</p>\n<p>All parts of your website must be accessible by keyboard only. That means, without a mouse or pointing device, your forms, menus, shopping cart and everything between. On top of that, you cannot require specific timings for keystrokes to access any feature.</p>\n",
   "wuhcag_tips": "<ul>\n <li>Unlike the lower-level Guideline 2.1.1, there are no exceptions here. All aspects of your website must be accessible by keyboard. It’s up to you to decide if Level AAA conformance is worth you removing any mouse-only features.</li>\n <li>Unplug your mouse and make sure you can fully use your website with your keyboard.</li>\n <li>Make sure no function on your website requires timed keystrokes (for example, ‘ double tap on enter within two seconds’ to submit).</li>\n <li>Don’t use ‘access keys’ (assigning a navigation link to a particular key) or page-specific key commands as they can conflict with assistive technology.</li>\n <li>Be wary of third-party adverts and widgets, often these are not accessible.</li>\n</ul>\n",
   "wuhcag_what_to_do": "<p>A clean <abbr title=\"HyperText Markup Language\">HTML</abbr> and <abbr title=\"Cascading Style Sheets\">CSS</abbr> website will often have keyboard accessibility without further work. This is a great example of why you need to invest in web design and development from the outset.</p>\n",
   "wuchcag_exceptions": "",
   "wuhcag_related": [
    "2-1-1",
    "2-1-2"
   ]
  }
 }
}